#ifndef ADVANCED_NAVIGATION_ANPP_HEADER_HPP
#define ADVANCED_NAVIGATION_ANPP_HEADER_HPP

#include <cstdint>
#include <algorithm>
#include <stdexcept>
#include <cstring>
#include <map>
#include <type_traits>
#include <base/Timeout.hpp>
#include <iodrivers_base/Exceptions.hpp>

#include <imu_advanced_navigation_anpp/Constants.hpp>
#include <imu_advanced_navigation_anpp/DeviceInformation.hpp>
#include <imu_advanced_navigation_anpp/Exceptions.hpp>

namespace imu_advanced_navigation_anpp
{
    /** Implementation of the ANPP protocol itself
     *
     * A iodrivers_base driver that uses this protocol is provided as Driver
     *
     * The general structure is that there is one struct per packet. Thse
     * structs represent the fixed-size part of the packet - some packets have
     * variable sizes. Structs that are meant to be sent to the device have a
     * marshal() method that returns the packet payload as a set of bytes.
     * Structs that are meant to be received have an unmarshal() static method
     * that return the struct from the payload data.
     */
    namespace protocol
    {
        /** Helper function to read a 64 bit value from a byte stream */
        template<typename T, typename InputIterator>
        inline T read16(InputIterator it)
        {
            static_assert(sizeof(T) == 2, "return type is not a 2-byte data type");
            uint16_t b0 = *it;
            uint16_t b1 = *(++it);
            uint16_t r = b0 | b1 << 8;
            return reinterpret_cast<T const&>(r);
        }

        /** Helper function to read a 64 bit value from a byte stream */
        template<typename T, typename InputIterator>
        inline T read32(InputIterator it)
        {
            static_assert(sizeof(T) == 4, "return type is not a 4-byte data type");
            uint32_t b0 = *it;
            uint32_t b1 = *(++it);
            uint32_t b2 = *(++it);
            uint32_t b3 = *(++it);
            uint32_t r = b0 | b1 << 8 | b2 << 16 | b3 << 24;
            return reinterpret_cast<T const&>(r);
        }

        /** Helper function to read a 32 bit value from a byte stream */
        template<typename T, typename InputIterator>
        inline T read64(InputIterator it)
        {
            static_assert(sizeof(T) == 8, "return type is not a 8-byte data type");
            uint64_t b0 = *it;
            uint64_t b1 = *(++it);
            uint64_t b2 = *(++it);
            uint64_t b3 = *(++it);
            uint64_t b4 = *(++it);
            uint64_t b5 = *(++it);
            uint64_t b6 = *(++it);
            uint64_t b7 = *(++it);
            uint64_t r = b0 | b1 << 8 | b2 << 16 | b3 << 24 | b4 << 32 | b5 << 40 | b6 << 48 | b7 << 56;
            return reinterpret_cast<T const&>(r);
        }

        /** Helper function to write a 16 bit value into a byte stream */
        template<typename T, typename Out>
        inline void write16(Out out, T sample)
        {
            static_assert(sizeof(T) == 2, "sample is not a 2-byte data type");
            uint16_t value = reinterpret_cast<uint16_t&>(sample);
            out[0] = value & 0xFF;
            out[1] = (value >> 8) & 0xFF;
        }

        /** Helper function to read a 64 bit value from a byte stream */
        template<typename T, typename Out>
        inline void write32(Out out, T sample)
        {
            static_assert(sizeof(T) == 4, "sample is not a 4-byte data type");
            uint32_t value = reinterpret_cast<uint32_t&>(sample);
            out[0] = (value >> 0) & 0xFF;
            out[1] = (value >> 8) & 0xFF;
            out[2] = (value >> 16) & 0xFF;
            out[3] = (value >> 24) & 0xFF;
        }

        /** Helper function to read a 32 bit value from a byte stream */
        template<typename T, typename Out>
        inline void write64(Out out, T sample)
        {
            static_assert(sizeof(T) == 8, "sample is not a 8-byte data type");
            uint64_t value = reinterpret_cast<uint64_t&>(sample);
            out[1] = (value >> 8) & 0xFF;
            out[2] = (value >> 16) & 0xFF;
            out[3] = (value >> 24) & 0xFF;
            out[4] = (value >> 32) & 0xFF;
            out[5] = (value >> 40) & 0xFF;
            out[6] = (value >> 48) & 0xFF;
            out[7] = (value >> 56) & 0xFF;
        }

        static constexpr int PACKET_ID_COUNT = 256;

        /** Generic packet header
         *
         * The data in the packet is stored in little endian byte order
         */
        struct Header
        {
            static constexpr int SIZE = 5;

            /** Longitudinal redundancy check for the header
             *
             * <code>
             * LRC = ((packet_id + packet_length + crc[0] + crc[1])^0xFF) + 1
             * </code>
             */
            uint8_t header_checksum;
            uint8_t packet_id;
